
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/19594207432)


<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * oci_core_instance.cloud_server
* Update
  * oci_core_network_security_group_security_rule.my_vcn_nw_sg__ingress__allow_icmp_traffics
  * oci_core_route_table.my_vcn_route_table


<details><summary>Change Result (Click me)</summary>

```hcl

  # oci_core_instance.cloud_server will be created
  + resource "oci_core_instance" "cloud_server" {
      + availability_domain                 = "uBnd:AP-OSAKA-1-AD-1"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaa3vcsovo36fpa7kf42sljmsypxgwrp37lowwl27g5n7pgy765krba"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "prd-csv-01"
      + extended_metadata                   = (known after apply)
      + fault_domain                        = (known after apply)
      + freeform_tags                       = (known after apply)
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_ai_enterprise_enabled            = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "locale"              = "en_US.UTF-8"
          + "packages"            = jsonencode(
                [
                  + "glibc-all-langpacks",
                  + "langpacks-en",
                  + "vim-enhanced",
                ]
            )
          + "ssh_authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMHZ+snXDFNVK89sfKAq1ULEI5yRLxqWQHYiVTGUVlb8
            EOT
          + "timezone"            = "Asia/Tokyo"
        }
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + security_attributes                 = (known after apply)
      + security_attributes_state           = (known after apply)
      + shape                               = "VM.Standard.A1.Flex"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config (known after apply)

      + availability_config (known after apply)

      + create_vnic_details {
          + assign_ipv6ip             = (known after apply)
          + assign_private_dns_record = false
          + assign_public_ip          = "true"
          + defined_tags              = (known after apply)
          + display_name              = (known after apply)
          + freeform_tags             = (known after apply)
          + hostname_label            = (known after apply)
          + nsg_ids                   = [
              + "ocid1.networksecuritygroup.oc1.ap-osaka-1.aaaaaaaaaixo4zhvj2vmdnqpzipbvitououl3tnbfaxafyli4rbhuwz4klvq",
            ]
          + private_ip                = (known after apply)
          + security_attributes       = (known after apply)
          + skip_source_dest_check    = (known after apply)
          + subnet_cidr               = (known after apply)
          + subnet_id                 = "ocid1.subnet.oc1.ap-osaka-1.aaaaaaaan4nh7khtpd3lm2lohe2qnbjimfemydvpxqialcg346jxgkfdefja"
          + vlan_id                   = (known after apply)

          + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      + instance_options (known after apply)

      + launch_options (known after apply)

      + launch_volume_attachments (known after apply)

      + licensing_configs (known after apply)

      + placement_constraint_details (known after apply)

      + platform_config (known after apply)

      + preemptible_instance_config (known after apply)

      + shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          + gpus                          = (known after apply)
          + local_disk_description        = (known after apply)
          + local_disks                   = (known after apply)
          + local_disks_total_size_in_gbs = (known after apply)
          + max_vnic_attachments          = (known after apply)
          + memory_in_gbs                 = 4
          + networking_bandwidth_in_gbps  = (known after apply)
          + nvmes                         = (known after apply)
          + ocpus                         = 2
          + processor_description         = (known after apply)
          + resource_management           = (known after apply)
          + vcpus                         = (known after apply)
        }

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.ap-osaka-1.aaaaaaaas5k7mfo4caqvmlamzvjif6rcmnu3fvs6nwtbleyhkyad2vflkmaa"
          + source_type             = "image"

          + instance_source_image_filter_details (known after apply)
        }
    }

  # oci_core_network_security_group_security_rule.my_vcn_nw_sg__ingress__allow_icmp_traffics will be updated in-place
  ~ resource "oci_core_network_security_group_security_rule" "my_vcn_nw_sg__ingress__allow_icmp_traffics" {
        id                        = "EAC797"
      ~ source                    = "10.0.21.0/24" -> "0.0.0.0/0"
        # (9 unchanged attributes hidden)
    }

  # oci_core_route_table.my_vcn_route_table will be updated in-place
  ~ resource "oci_core_route_table" "my_vcn_route_table" {
        id             = "ocid1.routetable.oc1.ap-osaka-1.aaaaaaaakarcgwdpmolfp7pu4bgd5u2r4c4misoq3ynvn2wfn6sxnucamv6q"
        # (7 unchanged attributes hidden)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = "ocid1.internetgateway.oc1.ap-osaka-1.aaaaaaaaqdovtlvyiywjiulgqwoi2p6qfjokpuqunfpt6v7vej2ys2pnfveq"
          + route_type        = (known after apply)
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ cloud-server__prd                = {
      ~ id   = "ocid1.instance.oc1.ap-osaka-1.anvwsljrmrimpjacxllxbmgdjqlagubyeyu4n6u5ctitd3qbkp7hvjvnwd4a" -> (known after apply)
        name = "prd-csv-01"
    }

Warning: Attribute Deprecated

  with cloudflare_pages_project.homepage,
  on my_homepage.tf line 1, in resource "cloudflare_pages_project" "homepage":
   1: resource "cloudflare_pages_project" "homepage" {

All new projects now use the Standard usage model.

(and one more similar warning elsewhere)
```

</details>



## :warning: Warnings

```hcl
Warning: Attribute Deprecated

  with cloudflare_pages_project.homepage,
  on my_homepage.tf line 1, in resource "cloudflare_pages_project" "homepage":
   1: resource "cloudflare_pages_project" "homepage" {

All new projects now use the Standard usage model.

(and one more similar warning elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":185,"Program":"tfcmt","SHA1":"b546090cd4f1b225b907dbc6c185f96f30aef3f1","Vars":{},"WorkflowName":"Terraform CI"} -->